src/purchase-on-rapidssl.org
#+title: 在RapidSSL上购买SSL证书

https://www.myssl.cn/ 这个应该是RapidSSL在中国的代理商. 这里有一些SSL相关的 [[https://www.myssl.cn/tools/][工具]]

1. 选择通配符证书
2. 证书有效期1年
3. 系统自动生成CSR (或者使用 [[https://www.myssl.cn/tools/create-csr.html][CSR在线生成]]) 另存为server.csr
  - Corporation: Your company name
  - Department: IT Department
  - City: Beijing
  - Province: Beijing
  - Country: CN
  - Domain name: https://*.your-domain-name
4. 下载密钥文件 ssl.key (内容开头和结尾有 =PRIVATE KEY=) 重命名为server.key. *(特别重要，不要再修改)*
5. 添加管理员信息，主要是管理员邮箱。这个邮箱会被通知颁发的certificate证书
6. 选择审批电子邮件地址. 比如admin, webmaster@<your-domain-name>. 通过邮件来验证你对该域名的所有权
7. 提交订单并且用支付宝支付，等待他们后台处理。处理完成后会向admin@<your-domain-name>发送一封确认邮件
8. 点击确认后，会给管理员邮箱发送certificate字符串 (开头和结尾有 =CERTIFICATE=). 另存为server.crt
9. 用 [[https://www.myssl.cn/tools/downloadchain.html][工具]] 生成中间证书. 按照 [[https://www.myssl.cn/home/article-0403-22.html][Nginx SSL证书安装]] 指示，需要将中间证书放在server.crt尾部。

至此我们有三个文件:
- server.csr (cert request)
- server.key (private key)
- server.crt (cert file)

在nginx中的配置如下
#+BEGIN_EXAMPLE
listen 443 ssl;
ssl_certificate server.crt;
ssl_certificate_key server key;
server_name <your-domain-name>
#+END_EXAMPLE
