html/purchase-on-rapidssl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>在RapidSSL上购买SSL证书</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">在RapidSSL上购买SSL证书</h1>
<p>
<a href="https://www.myssl.cn/">https://www.myssl.cn/</a> 这个应该是RapidSSL在中国的代理商. 这里有一些SSL相关的 <a href="https://www.myssl.cn/tools/">工具</a>
</p>

<ol class="org-ol">
<li>选择通配符证书
</li>
<li>证书有效期1年
</li>
<li>系统自动生成CSR (或者使用 <a href="https://www.myssl.cn/tools/create-csr.html">CSR在线生成</a>) 另存为server.csr
<ul class="org-ul">
<li>Corporation: Your company name
</li>
<li>Department: IT Department
</li>
<li>City: Beijing
</li>
<li>Province: Beijing
</li>
<li>Country: CN
</li>
<li>Domain name: <a href="https://*.your-domain-name">https://*.your-domain-name</a>
</li>
</ul>
</li>
<li>下载密钥文件 ssl.key (内容开头和结尾有 <code>PRIVATE KEY</code>) 重命名为server.key. <b>(特别重要，不要再修改)</b>
</li>
<li>添加管理员信息，主要是管理员邮箱。这个邮箱会被通知颁发的certificate证书
</li>
<li>选择审批电子邮件地址. 比如admin, webmaster@&lt;your-domain-name&gt;. 通过邮件来验证你对该域名的所有权
</li>
<li>提交订单并且用支付宝支付，等待他们后台处理。处理完成后会向admin@&lt;your-domain-name&gt;发送一封确认邮件
</li>
<li>点击确认后，会给管理员邮箱发送certificate字符串 (开头和结尾有 <code>CERTIFICATE</code>). 另存为server.crt
</li>
<li>用 <a href="https://www.myssl.cn/tools/downloadchain.html">工具</a> 生成中间证书. 按照 <a href="https://www.myssl.cn/home/article-0403-22.html">Nginx SSL证书安装</a> 指示，需要将中间证书放在server.crt尾部。
</li>
</ol>

<p>
至此我们有三个文件:
</p>
<ul class="org-ul">
<li>server.csr (cert request)
</li>
<li>server.key (private key)
</li>
<li>server.crt (cert file)
</li>
</ul>

<p>
在nginx中的配置如下
</p>
<pre class="example">
listen 443 ssl;
ssl_certificate server.crt;
ssl_certificate_key server key;
server_name &lt;your-domain-name&gt;
</pre>
</div>
</body>
</html>
